using System;
using System.Collections.Generic;
using System.Text;

namespace DFToys.PvfCache.Internals
{
    internal sealed class GameStringComparer : IComparer<string>
    {
        public static readonly GameStringComparer Instance = new GameStringComparer();

        private const int CUSTOM_VALUE = 0x1FFFFF00;
        private const int LAST_VALUE = CUSTOM_VALUE + 1;


        private static readonly Dictionary<string, int> s_stringOrderDict = new Dictionary<string, int>()
        {
            {"通用",000 },
            {"鬼剑士",001 },{"格斗家(女)",002},{"格斗家(男)",003 },{"神枪手(男)",004 },{"神枪手(女)",005 },{"魔法师(女)",006 },{"魔法师(男)",007 },{"圣职者",008 },{"暗夜使者",009 },{"黑暗武士",010 },{"缔造者",011 },
            {"无限制",001 },{"封装",002 },{"账号绑定",003},{"不可交易",004 },{"不可交易，不可删除",005 },
            {"宠物装备-蓝",006 },{"宠物装备-绿",007 },{"宠物装备-红",008},
            {"武器",001 },{"防具",002 },{"饰品",003},{"装扮",004 },{"宠物",005 },
            {"布甲",001 },{"皮甲",002 },{"轻甲",003},{"重甲",004 },{"板甲",005 },
            {"短剑",001 },{"武士刀",002 },{"钝器",003},{"巨剑",004 },{"光剑",005 },
            {"手套",001 },{"臂铠",002 },{"格斗爪",003},{"拳套",004 },{"东方棍",005 },
            {"左轮",001 },{"自动手枪",002 },{"步枪",003},{"手炮",004 },{"手弩",005 },
            {"战矛",001 },{"长棍",002 },{"魔杖",003},{"法杖",004 },{"扫把",005 },
            {"十字架",001 },{"念珠",002 },{"图腾",003},{"镰刀",004 },{"战斧",005 },
            {"匕首",001 },{"双剑",002 },{"手杖",003},
            {"头部",001 },{"帽子",002 },{"上装",003},{"面部",004 },{"胸部",005 },{"腰部",006 },{"下装",007 },{"皮肤",008 },{"鞋",009 },{"光环",010 },
            {"上衣",001 },{"护肩",002 },{"下衣",003},{"腰带",004 },
            {"项链",001 },{"手镯",002 },{"戒指",003},{"称号",004 },{"附加装备",005 },{"魔法石",006 },
            {"普通",001 },{"高级",002 },{"稀有",003},{"神器",004 },{"史诗",005 },{"勇者",006 },{"传说",007 },{"神话",008 },
            {"消耗品",001 },{"材料",002},{"任务物品",003 },{"副职业材料",004 },{"时装包",005 },{"副职业镶嵌",006 },{"设计图",007 },{"无限物品",008 },{"宠物相关",009 },{"时装徽章",010 },{"自选包",011 },
            {"染色剂",012 },{"便携道具",013},{"礼包类",014 },{"抽奖类",015 },{"全局道具",016 },{"契约",017 },{"秘药",018 },{"COS道具",019 },{"气氛类",020 },{"任务通告",021 },{"投掷道具",022 },
            {"陷阱",023 },
            {"其他",LAST_VALUE }
        };

        public int Compare(string x, string y)
        {
            var a = s_stringOrderDict.TryGetValue(x, out int v1);
            var b = s_stringOrderDict.TryGetValue(y, out int v2);

            if (!a)
            {
                return b ? CUSTOM_VALUE.CompareTo(v2) : x.CompareTo(y);
            }
            else if (b)
            {
                return v1.CompareTo(v2);
            }
            else
            {
                return v1.CompareTo(CUSTOM_VALUE);
            }
        }
    }
}
